"StartAllServers" = "Server starten";
"StopAllServers" = "Server beenden";
"wrongFolderAlertHeadline" = "MAMP konnte nicht gestartet werden!";
"wrongFolderAlertText" = "Der MAMP-Ordner muss sich im Verzeichnis 'Programme' befinden.";
"ok" = "OK";
"language" = "German";
"isoLanguage" = "de";
"tourLanguage" = "de";

"key_sorry" = "Achtung";
"key_osTooLow" = "MAMP arbeitet erst ab Mac OS X 10.10 (Yosemite)!";

"mysqlTool_titleUpgrade" = "MySQL-Datenbanken aktualisieren…";
"mysqlTool_titleRepair" = "MySQL-Datenbanken reparieren…";
"mysqlTool_titleCheck" = "MySQL-Datenbanken überprüfen…";
"mysqlTool_messageUpgrade" = "Vor der Aktualisierung der Datenbanken wird empfohlen, ein Backup der MySQL-Datenbanken zu erstellen!";
"mysqlTool_messageRepair" = "Ehe Sie einen Reparaturversuch starten, sollten Sie ein Backup der MySQL-Datenbanken erstellen!";
"mysqlTool_messageCheck" = "Überprüfung der MySQL-Datenbanken auf mögliche Fehler und Aktualisierungs-Möglichkeiten.";
"mysqlTool_doItUpgrade" = "Aktualisieren";
"mysqlTool_doItRepair" = "Reparieren";
"mysqlTool_doItCheck" = "Überprüfen";
"mysqlTool_done" = "Abbrechen";
"mysqlTool_statusFailed" = "Failed";

"mysqlQuickCheck_dontShow" = "Nicht mehr zeigen!";
"mysqlQuickCheck_NeedsUpgradeTitle" = "Die MySQL-Datenbanken sollten aktualisiert werden.";
"mysqlQuickCheck_NeedsUpgradeMsg" ="Sie sollten die MySQL-Datenbanken möglichst schnell über den Menüpunkt 'Werkzeuge → MySQL-Datenbanken aktualisieren' auf den neuesten Stand bringen. Wenn Sie 'OK' klicken, öffnet sich die Funktion automatisch.";
"mysqlQuickCheck_NeedsUpgradeErrorTitle" = "Die Überprüfung der MySQL-Datenbanken ist fehlgeschlagen.";
"mysqlQuickCheck_NeedsUpgradeErrorMsgFormat" = "Fehlermeldung:\n\n%@";

"ChooseDocRootTitle" = "Bitte legen Sie das Stammverzeichnis fest:";
"Select" = "Auswählen";
"Preferences" = "Einstellungen …";

"httpServerNameApache" = "Apache-Server";
"httpServerNameNginx" = "Nginx-Server";

"error" = "Fehler";
"portInUse" = "%@ konnte nicht gestartet werden, weil eine andere Software bereits Port %@ nutzt.";
"couldntStartServer" = "%@ konnte nicht gestartet werden. Bitte überprüfen Sie die MAMP-Installation und -Konfiguration.";
"noDocumentRoot" = "Bitte weisen Sie dem Webserver ein Document Root zu.";
"problemWithPort" = "Es gibt ein Problem mit dem Port für %@. Bitte überprüfen Sie die Konfiguration, der Port muss zwischen %@ und 65535 liegen.";
"duplicatePorts" = "Es gibt ein Problem mit den Server-Ports. Ein Port darf nur einem Server zugewiesen werden. Bitte überprüfen Sie die Konfiguration.";

"TourOfMampPro" = "MAMP PRO entdecken";

"ThankYou" = "Vielen Dank!";
"ThankYouInfo" = "Danke, dass Sie sich die Zeit genommen haben, uns bei der Weiterentwicklung von MAMP zu helfen! Wir wissen Ihre Hilfe zu schätzen.";

"key_UpdateMAMPTitle" = "MAMP-Update";
"key_LearnMore" = "Mehr Info";
"key_UpdateInformativeText" = "MAMP %@ wurde veröffentlicht. Weitere Informationen zu dieser Version erhalten Sie, wenn Sie auf 'Mehr Info' klicken.";
"key_UpdateSuppressionButtonTitle" = "Diese Version nicht mehr melden";

"key_EncryptionFailure" = "Bitte starten Sie MAMP neu und versuchen Sie es noch einmal. Erscheint diese Meldung weiterhin, müssen Sie MAMP neu installieren.";
"key_MamphelperObjectConnectionFailure" = "Bitte starten Sie MAMP neu und versuchen Sie es noch einmal. Erscheint diese Meldung weiterhin, müssen Sie MAMP neu installieren.";

"key_Yes" = "Ja";
"key_No" = "Nein";
"key_Retry" = "Nochmal";
"key_CloudLoginFailed" = "Anmeldung fehlgeschlagen!";
"key_MaybeWrongCredentials" = "Möglicherweise sind Benutzername und/oder Password nicht korrekt.";
"key_CloudDemoStartFailed" = "Die Cloud-Testphase ließ sich nicht starten!";
"key_CloudDemoStartFailedMsg" = "Beim Starten der Cloud-Testphase ist ein Fehler aufgetreten.";

"key_SavingToCloud" = "In der Cloud speichern";
"key_LoadingFromCloud" = "Aus der Cloud laden";
"key_PreparingSaveToCloud" = "Speichern in der Cloud vorbereiten …";
"key_PreparingLoadFromCloud" = "Laden aus der Cloud vorbereiten …";
"key_CompressingDocumentRoot" = "Stammverzeichnis komprimieren …";
"key_DecompressingDocumentRoot" = "Stammverzeichnis dekomprimieren …";
"key_DecompressingArchive" = "Archiv auspacken …";
"key_CheckingArchive" = "Version des Archivs überprüfen …";
"key_SavingMySqlData" = "MySQL-Daten speichern …";
"key_LoadingMySqlData" = "MySQL-Daten laden …";
"key_CompressingMySqlData" = "MySQL-Daten komprimieren …";
"key_DecompressingMySqlData" = "MySQL-Daten dekomprimieren …";
"key_MySQLNotRunning" = "MySQL läuft nicht!";
"key_CreatingArchive" = "Archiv anlegen …";
"key_EncryptingArchive" = "Archiv verschlüsseln …";
"key_DecryptingArchive" = "Archiv entschlüsseln 
";
"key_UploadingToDropbox" = "In der Cloud speichern …";
"key_DownloadingFromDropbox" = "Aus der Cloud laden …";
"key_CloudActivatingSettings" = "Einstellungen aktivieren …";
"key_CloudCopyingDocumentRoot" = "Stammverzeichnis kopieren …";
"key_CloudCleaningUp" = "Aufräumen …";
"key_CloudActionCompleted" = "Fertig!";
"key_CloudStartTransferring" = "Datenübertragung vorbereiten …";
"key_CloudStopTransferring" = "Datenübertragung  abschließen …";
"key_PreparingNextStep" = "Nächsten Schritt vorbereiten …";
"key_CloudLoadingDataFormat" = "Daten werden vorbereitet: %.f%@ von %.f%@ …";


"key_CouldNotEncryptHostData" = "Die Daten konnten nicht verschlüsselt werden.";
"key_CouldNotDecryptHostData" = "Die Daten konnten nicht entschlüsselt werden.";
"key_CouldNotValidateArchive" = "Die Daten ließen sich nicht überprüfen, möglicherweise ist ihr Format nicht mit dieser Version von MAMP kompatibel.";
"key_CouldNotImportDatabaseUser" = "Der für den Zugriff auf die Datenbank benötigte MySQL-Benutzer konnte nicht angelegt werden.";
"key_CouldNotExportDatabaseUser" = "Der Datanbank-Benutzer konnte nicht gefunden werden. Möglicherweise ist der ausgewählten Datenbank kein Benutzer zugeordnet.";
"key_CouldNotReadHostSettings" = "Die Einstellungen des Host konnten nicht korrekt gelesen werden.";
"key_CouldNotMoveDocumentRootToItsPlace" = "Das Stammverzeichnis konnte nicht an den Zielort bewegt werden!";
"key_CouldNotImportDatabase" = "Die MySQL-Daten konnten nicht importiert werden.";
"key_CouldNotExportDatabase" = "Die MySQL-Daten konnten nicht exportiert werden.";
"key_CouldNotZipArchive" = "Die Daten konnte nicht komprimiert werden.";
"key_CouldNotUnzipArchive" = "Die Daten konnte nicht entpackt werden.";
"key_CouldNotDownloadData" = "Die Daten konnten nicht von Dropbox geladen werden.";
"key_CouldNotUploadData" = "Die Daten konnten nicht zu Dropbox übertragen werden.";

"key_AskForCloudDataConfirmation" = "Zukünftig nicht mehr nachfragen, wenn keine Datenbank ausgewählt ist";
"key_AskForCloudDataConfirmationTitle" = "Sie haben KEINE Datenbank ausgewählt. Sind Sie sicher, dass Sie weitermachen wollen?";
"key_SelectDB" = "Datenbank auswählen …";

"key_Choose" = "Auswählen";
"key_ChooseEncryptionKeyFile" = "Bitte wählen Sie die txt-Datei mit dem Sicherheitsschlüssel:";
"key_MoreToMinimumKeyLengthFormat" = "Noch mindestens %lu Zeichen werden benötigt!";
"key_MinimumKeyLengthReached" = "Minimale Schlüssellänge ist erreicht.";
"key_MoreToPerfectLengthFormat" = "Noch %lu Zeichen bis zur perfekten Schlüssellänge!";
"key_KeyPerfectLength" = "Perfekte Schlüssellänge!";
"key_KeyTooLong" = "Sicherheitsschlüssel zu lang!";

"key_NoInternetConnection" = "Keine Internet-Verbindung";
"key_Loading" = "Laden …";

"key_SaveToCloudErrorTitle" = "Fehler beim Speichern in der Cloud";
"key_SaveToCloudErrorMsg" = "Das Speichern ist fehlgeschlagen. Bitte stellen Sie sicher, dass Stammverzeichnis und Datenbank (falls ausgewählt) existieren, und falls nötig, der richtige Schlüssel eingegeben ist.";
"key_LoadFromCloudErrorTitle" = "Fehler beim Laden aus der Cloud";
"key_LoadFromCloudErrorMsg" = "Das Laden ist fehlgeschlagen. Bitte stellen Sie sicher, dass der richtige Schlüssel eingegeben ist.";

"key_CloudDemoExpired" = "Die Testphase für die Cloud-Funktionen ist beendet. Bitte geben Sie eine Seriennummer ein oder kaufen Sie eine Lizenz.";
"key_CloudRegistrationIssue" = "Bitte stellen Sie sicher, dass Sie die korrekt Seriennummer verwenden, oder kontaktieren Sie <mail@mamp.info>.";

"key_DeleteFromCloud" = "Aus der Cloud löschen";
"key_DeleteFromCloudConfirmation" = "Sind Sie sicher, dass Sie die Daten aus der Cloud löschen wollen?";

"key_Delete" = "Löschen";
"key_Register" = "Registrieren";
"key_BuyCloudFeature" = "Lizenz für Cloud-Funktionen kaufen";
"key_StartDemo" = "Demo starten";
"key_DemoStartedTitle" = "Testphase gestartet";
"key_DemoStartedMsg" = "Die Testphase für die Cloud-Funktionen wurde gestartet. Sie läuft für 14 Tage, viel Spaß damit!";

"key_CloudDemoExpiredTitle" = "Testphase abgelaufen";
"key_CloudDemoExpiredMsg" = "Die Testphase für die Cloud-Funktionen ist beendet.";

"key_MC_DemoExpiresInDaysFormat" = "MAMP Cloud Demo: noch %ld Tage";
"key_MP_DemoExpiresInDaysFormat" = "MAMP PRO Demo: noch %ld Tage";
"key_MP_DemoExpiresTomorrow" = "MAMP PRO Demo läuft morgen ab";
"key_MC_DemoExpiresTomorrow" = "MAMP Cloud Demo läuft morgen ab";
"key_MC_DemoExpiresToday" = "MAMP Cloud Demo läuft heute ab";
"key_MP_DemoExpiresToday" = "MAMP PRO Demo läuft heute ab";
"key_MP_DemoExpired" = "MAMP PRO Demo ist abgelaufen";
"key_MP_DemoNotStartedYet" = "Jetzt MAMP PRO testen";

"key_CloudServiceOff" = "Aus";
"key_CloudServiceOn" = "An";

"key_NoDatabaseAvailable" = "-";

"key_registrationErrorTitle" = "Oops!";
"key_registrationErrorMsg" = "Es ist etwas schiefgelaufen bei der Registrierung. Sie benötigen Administratorrechte, um Mamp Cloud zu registrieren. Für weitere Fragen, bitte wenden Sie sich an <mail@mamp.info>.";
"key_registrationSuccessTitle" = "Registrierung war erfolgreich";
"key_registrationSuccessMsg" = "Vielen Dank, dass Sie Ihre Kopie von MAMP-Cloud-Funktionen registriert haben.";

"key_buyAlertErrorMsg_Internet" = "Es scheint keine Internet-Verbindung zu bestehen.";

"key_CloudFeatureNotRegisterMenuItemTitle" = "Cloud-Lizenz eingeben";
"key_CloudFeatureAlreadyRegisterMenuItemTitle" = "MAMP-Cloud ist registriert.";

"key_TurnOn" = "Anschalten";
"key_TurnOff" = "Ausschalten";
"key_CloudDemoIsExpired" = "Die Testphase ist abgelaufen";
"key_SerialNumber" = "Seriennummer:";

"key_BuyMampCloudSecure" = "MAMP-Cloud kaufen %@";
"key_storeDidReceivedErrorTitle" = "Es ist etwas schiefgelaufen.";

"key_storeDidReceivedErrorMsg_StoreError" = "Bitte prüfen Sie Ihr Postfach, ob Sie eine Seriennummer erhalten haben, oder setzen Sie sich mit <help@paddle.com> in Verbindung.";
"key_ThankYouPurchaseAlertTitle" = "Vielen Dank, dass Sie eine Lizenz für die Cloud-Funktionen von MAMP gekauft haben. Sie fördern damit die weitere Entwicklung des Programms.";
"key_ThankYouPurchaseAlertMessage_FailGetSerial" = "Vielen Dank, dass Sie MAMP PRO gekauft haben.\n\nWenn Sie Ihre Registrierdaten nicht innerhalb der nächsten 30 Minuten per E-Mail erhalten, wenden Sie sich bitte an <support@mamp.info>.";
"key_ThankYouPurchaseAlertMessage_InstallationOk" = "Vielen Dank, dass Sie MAMP-Cloud gekauft haben.\n\nIhre Registrierdaten wurden gespeichert, wir haben sie Ihnen auch per E-Mail geschickt. Bitte bewahren Sie sie an einem sicheren Ort auf.";
"key_ThankYouPurchaseAlertMessage_SerialNotOk" = "Es gibt ein Problem mit Ihrer Seriennummer. Bitte wenden Sie sich an <mail@mamp.info>.";

"key_storeMampCloudTitle" = "MAMP-Cloud";
"key_storeMampCloudMessage" = "Die Lizenz für die Cloud-Funktionen von MAMP müssen Sie nur einmalig kaufen, Sie können sie auch mit zukünftigen Versionen des Programms verwenden.";

"key_MampWantsToStartHelper" = "MAMP muss ein Hilfsprogramm starten, um Server starten und beenden zu können, um Benutzer zu wechseln und die Cloud-Funktionen zu verwenden.";
"key_MampCouldNotStartHelper" = "MAMP konnte den Vorgang nicht abschließen, da das Hilfsprogramm nicht mit Administrator-Rechten gestartet werden konnte.";

"key_CloudDataDetectedTitle" = "MAMP hat Daten in der Cloud gefunden!";
"key_CloudChangesDetectedTitle" = "Es gibt neuere Daten in der Cloud!";
"key_CloudChangesDetectedMsg" = "Wollen Sie diese Daten aus der Cloud laden?";

"key_Cancel" = "Abbrechen";
"key_Continue" = "Weiter";
"key_StepXofYFormat" = "Schritt %i von %i";
"key_CloudError" = "Ein Fehler ist aufgetreten!";
"key_CloudErrorSeeLog" = "Bitte prüfen Sie das Protokoll 'cloud_mamp.log', um mehr über die Ursache des Fehlers zu erfahren.";
"key_CloudErrorSeeLogFormat" = "%@\n\nIm Protokoll 'cloud_mamp.log' finden Sie u.U. weitere Informationen.";
"key_OpenLog" = "Protokoll öffnen";

"key_UserExistedTitle" = "Der Datenbank-Benutzer existierte bereits!";
"key_UserExistedMsg" = "Der Datenbank-Benutzer für den Zugriff auf die importierte Datei existierte auf diesem System bereits. Das ist kein Fehler, stellen Sie aber bitte trotzdem sicher, dass der Benutzer alle nötigen Zugriffsrechte besitzt.";

"key_DeleteFailed" = "Das Löschen ist fehlgeschlagen!";
"key_RestartAndTryAgain" = "Bitte starten Sie die Anwendung neu und versuchen Sie es noch einmal!";
"key_TryAgain" = "Bitte versuchen Sie es noch einmal!";
"key_CloudStructureInvalid" = "Die Einstellungen von MAMP scheinen beschädigt zu sein. Wenn dieser Fehler bestehen bleibt, versuchen Sie es bitte mit einer Neuinstallation.";
"key_CloudEncryptionKeyMissing" = "Der Sicherheitsschlüssel scheint zu fehlen. Bitte schalten Sie die Verschlüsselung ab oder geben Sie den Schlüssel neu ein.";
"key_CloudEncryptionKeyNotNeeded" = "Die Datei, die Sie aus der Cloud laden möchten, verwendet keine Verschlüsselung. Bitte deaktivieren Sie die Option Verschlüsselung in Ihren Cloud-Einstellungen.";
"key_CloudTmpDirectoryFailed" = "Ein temporäres Verzeichnis ließ sich nicht anlegen. Bitte versuchen Sie es noch einmal!";
"key_CloudDocumentRootMissing" = "Das ausgewählte Stammverzeichnis fehlt.";
"key_CouldNotGetPassword4MySQLRoot" = "Das Passwort des MySQL-Kontos 'root' konnte nicht bestimmt werden.";
"key_InternalError" = "Ein interner Fehler ist aufgetreten. Bitte starten Sie die Anwendung neu und versuchen Sie es noch einmal!";
"key_CloudDocRootEmptyAndNoDatabase" = "Es gibt nichts zu sichern: Das Stammverzeicnis ist leer und es ist keine Datenbank ausgewählt.";

"key_AdminAccountRequiredText" = "Administrator-Konto erforderlich";
"key_AdminAccountRequiredInfo" = "Leider können nur Benutzer mit Administrator-Rechten diese Version von Mamp ausführen.";
"Buy now" = "Jetzt kaufen";

"Stop" = "Stopp";
